OdGeCurve2d.closestPointTo(OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeInterval!System.Runtime.CompilerServices.IsConst*,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Finds the closest point on this curve to the input point.
\param point  [in]  Point to be evaluated.
\param param [out]  uv-coord of closest point.
\param range  [in]  Interval on the curve.
\param tol    [in]  Geometric tolerance.
\returns The closest point on this curve.
\remarks
Native interval is not considered.
If projection of the point does not lie in range-interval, the closest bound
of the interval is returned.
In case of uvBox == NULL closestPointTo(point, range, tol) is called where
range is a native curves interval.
An unbounded interval should not be used here.